{
  "types":
    [
      {
        "id": "corridor",
        "name": "a stone corridor",
        "description": "Flickering torches line the walls of this narrow stone corridor, providing barely enough light to see. Every now and then, the sound of a water droplet hitting the floor echoes from one of the numerous places where the arched ceiling is leaking.",
        "categories": [
          "corridor",
          "dungeon"
        ],
        "rarity": 5
      },
      {
        "id": "entrance",
        "name": "a simple stone cell",
        "description": "Large grey bricks are illuminated by the bleak light filtering in through a small, rough-cut skylight in the ceiling. The room's only exit is a stark doorway, cold iron rod door left swinging on its hinges. Metal shackles hang from the wall, the cuffs rusted and old, but still strong enough to restrain an unruly captive. Moss grows in the cracks between the stone, tracing the outlines in green like a maze of vegetation. In the corner of the room you can see a rough looking cot made from stone and lined with moist sticky hay. A mildewy smell fills the room and stuffs your nostrils as you try to breathe through the musty odour.",
        "categories": [
          "safe"
        ],
        "rarity": 0
      },
      {
        "id": "boss1",
        "name": "a cavernous lair",
        "description": "Compared to the rest of the maze, this room feels oppressively hot, and the stench of sulfur assaults your senses mercilessly. Jagged stalagmites jut out from the floor along the edges of the room and similarly wicked stalactites hang threateningly from the ceiling, but the room's centre seems to have been cleared out and flattened.",
        "categories": ["boss"],
        "rarity": 0
      },
      {
        "id": "fountain",
        "name": "a large fountain",
        "description": "In the centre of the room sits a large elaborately carved fountain.",
        "categories": [
          "water",
          "fountain",
          "dungeon"
        ],
        "rarity": 1
      },
      {
        "id": "forest",
        "name": "an indoors forest",
        "description": "The floor is covered in soft grass, and deciduous trees that reach the high ceiling are everywhere. Between their leaves and the mist covering the room, much of the area is obscured.",
        "categories": [
          "plant"
        ],
        "rarity": 1
      },
      {
        "id": "kitchen",
        "name": "a kitchen",
        "description": "A large oven sits against one wall, and a series of counters with various cooking implements line the room.",
        "categories": [
          "dungeon",
          "cooking"
        ],
        "rarity": 1
      },
      {
        "id": "lake",
        "name": "an underground lake",
        "description": "The majority of this room is taken up by a large underground lake. The glassy surface of the lake reflects the walls and ceiling perfectly, making the room appear even larger than it is, and the cool air comes as a welcome reprieve from the stale stuffiness of other parts of the maze.",
        "categories": [
          "dungeon",
          "water"
        ],
        "rarity": 1
      },
      {
        "id": "alchemy",
        "name": "an alchemy laboratory",
        "description": "Various benches and counters covered with various beakers, burners, and other laboratory equipment line this room. In certain spots, burn marks are visible on the counters, floor, and in a few cases even the ceiling. Multicoloured smoke, ostensibly from previous experiments, lingers in the air, bringing with it a plethora of smells and sensations as you move through the room. ",
        "categories": [
          "dungeon",
          "lab",
          "alchemy"
        ],
        "rarity": 1
      },
      {
        "id": "graveyard",
        "name": "a graveyard",
        "description": "The floor, or rather ground, of this chamber is composed of soft soil. Row upon row of gravestones populate the area. Despite the lack of wind and weather underground, most of the gravestones look old and worn, what writing was once engraved in them being completely illegible. However, a few of the stones appear newer. ",
        "categories": [
          "dungeon",
          "undead"
        ],
        "rarity": 1
      },
      {
        "id": "statues",
        "name": "a statue-lined corridor",
        "description": "Large statues carved from stone line this corridor, all of which leer silently down at you as you pass underneath them. Each statue is unique, depicting a variety of fantastical creatures and humanoid monsters, some of which you recognise, though several of which are completely unfamiliar to you. The uncomfortable feeling of being watched hangs over you no matter where you go.",
        "categories": [
          "dungeon",
          "statue"
        ],
        "rarity": 1
      },
      {
        "id": "library",
        "name": "a sprawling library",
        "description": "The smell of musty books pervades long before you enter. The tall room stretches into the rafters high above.  Warped oaken bookcases tower into the darkness above; bent and twisted with age and laden with once-orderly books and tomes. The dim lanterns that hang on chains from the rafters cast an ominous haze throughout the dust-stricken archive. It’s an oppressive maze of disorderly shelves and stacks of discarded books tucked into every alcove.",
        "categories": [
          "dungeon",
          "library"
        ],
        "rarity": 1
      }
    ]
}